; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-7)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(free left)
(free right)
(at ball1 roomb)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room4)
(at ball6 room5)
(at ball7 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 room3)
(at ball6 room3)
(at ball7 room4)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 0 of 7
2. (pick ball1 roomb left)
   deleted: (at ball1 roomb) (free left)
   added: (carry ball1 left)
   goals met: 0 of 7
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 0 of 7
4. (drop ball1 rooma left)
   deleted: (carry ball1 left)
   added: (at ball1 rooma) (free left)
   goals met: 1 of 7
5. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 1 of 7
6. (pick ball7 room5 left)
   deleted: (at ball7 room5) (free left)
   added: (carry ball7 left)
   goals met: 1 of 7
7. (pick ball6 room5 right)
   deleted: (at ball6 room5) (free right)
   added: (carry ball6 right)
   goals met: 1 of 7
8. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 1 of 7
9. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 1 of 7
10. (drop ball7 room4 left)
   deleted: (carry ball7 left)
   added: (at ball7 room4) (free left)
   goals met: 2 of 7
11. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 2 of 7
12. (drop ball6 room3 right)
   deleted: (carry ball6 right)
   added: (at ball6 room3) (free right)
   goals met: 3 of 7
13. (pick ball4 room3 left)
   deleted: (at ball4 room3) (free left)
   added: (carry ball4 left)
   goals met: 3 of 7
14. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 3 of 7
15. (drop ball4 roomb left)
   deleted: (carry ball4 left)
   added: (at ball4 roomb) (free left)
   goals met: 4 of 7
16. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 4 of 7
17. (pick ball5 room4 left)
   deleted: (at ball5 room4) (free left)
   added: (carry ball5 left)
   goals met: 4 of 7
18. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 4 of 7
19. (drop ball5 room3 left)
   deleted: (carry ball5 left)
   added: (at ball5 room3) (free left)
   goals met: 5 of 7
20. (pick ball3 room3 right)
   deleted: (at ball3 room3) (free right)
   added: (carry ball3 right)
   goals met: 5 of 7
21. (pick ball2 room3 left)
   deleted: (at ball2 room3) (free left)
   added: (carry ball2 left)
   goals met: 5 of 7
22. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 5 of 7
23. (drop ball3 rooma right)
   deleted: (carry ball3 right)
   added: (at ball3 rooma) (free right)
   goals met: 6 of 7
24. (drop ball2 rooma left)
   deleted: (carry ball2 left)
   added: (at ball2 rooma) (free left)
   goals met: 7 of 7
